---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySketchGrid
source: html/1c563594-c3aa-d417-ba69-7177c1728677.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySketchGrid Property

Work Planes cannot be copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopySketchGrid { get; }
```